tangyangguang/Stc8hBase/core/stc8h_interrupt.h
#ifndef STC8H_INTERRUPT_H
#define STC8H_INTERRUPT_H

#include "stc8h_config.h"

#define STC8H_VECTOR_INT0 0
#define STC8H_VECTOR_TIMER0 1
#define STC8H_VECTOR_INT1 2
#define STC8H_VECTOR_TIMER1 3
#define STC8H_VECTOR_UART1 4
#define STC8H_VECTOR_UART2 8
#define STC8H_VECTOR_INT2 10
#define STC8H_VECTOR_INT3 11
#define STC8H_VECTOR_INT4 16
#define STC8H_VECTOR_UART3 17
#define STC8H_VECTOR_UART4 18
#define STC8H_VECTOR_TIMER3 19
#define STC8H_VECTOR_TIMER4 20
#define STC8H_VECTOR_COMPARATOR 21
#define STC8H_VECTOR_I2C 24
#define STC8H_VECTOR_USB 25
#define STC8H_VECTOR_PWMA 26
#define STC8H_VECTOR_PWMB 27
#define STC8H_VECTOR_TKSU 35
#define STC8H_VECTOR_RTC 36
#define STC8H_VECTOR_PORT0 37
#define STC8H_VECTOR_PORT1 38
#define STC8H_VECTOR_PORT2 39
#define STC8H_VECTOR_PORT3 40
#define STC8H_VECTOR_PORT4 41
#define STC8H_VECTOR_PORT5 42
#define STC8H_VECTOR_PORT6 43
#define STC8H_VECTOR_PORT7 44

void stc8h_interrupt_enable_global(void);
void stc8h_interrupt_disable_global(void);

#endif
